tap "cue-lang/tap"
tap "homebrew/cask"
tap "jzelinskie/faq"
tap "txn2/tap"
brew "act" # github actions
brew "autojump" # a smarter cd
brew "awscli" # AWS cloud cli
brew "axel" # a faster curl
brew "azure-cli" # Azure cloud cli
brew "bash-completion" # back shell tab completions
brew "bat" # a more colorful 'cat' command
brew "binwalk" # https://github.com/ReFirmLabs/binwalk
brew "black" # python code formatter
brew "broot" # a better 'tree' command
brew "btop" # a more intuitive, prettier 'top' command
brew "cloc" # statistics utility to count lines of code
brew "cmake" # for building c code
brew "coreutils" # must be installed for tmux network status plugin
brew "cowsay" # a more stupid 'echo' command
brew "ctags" # generate an index file of language objects for a file
brew "cue-lang/tap/cue" evaluate CUE files
brew "curl" # use HTTP protocol from command line
brew "diffstat" # make histogram of diff-output
brew "entr" # run arbitrary commands when files change
brew "exa" # a faster, prettier 'ls' command
brew "ffmpeg" # modify media files (image, video, audio) from command line
brew "fio" # io benchmark tool
brew "flake8" # python linter (must be installed for vim-ale)
brew "gawk" # must be installed for tmux network status plugin
brew "gh" # github command line extension
brew "git" # the most important
brew "git-crypt" # transparent file encryption in Git
brew "git-delta" # for prettier `git diff`
brew "glances" # a prettier 'top' command (not as pretty as `htop` or `btop`)
brew "gnu-sed" # gsed, a GNU implementation of the stream editor ('sed' command)
brew "go" # the language, go-lang
brew "golangci-lint" # go linter
brew "goreman" # manage procfile-based applications, a Go re-write of foreman
brew "gping" # a prettier 'ping' command
brew "http-prompt" # interactive http request shell
brew "httpie" # a more intuitive 'curl'
brew "htop" # a prettier 'top'
brew "hugo" # template-based static site generator
brew "iftop" # 'top' for network interfaces
brew "imagemagick" # create, compress, convert images
brew "jpegoptim" # optimise JPEG images
brew "jzelinskie/faq/faq" # like jq for JSON, but more formats (https://github.com/jzelinskie/faq)
brew "kind" # something for kubernetes, idk
brew "kubectx" # a wrapper around 'kubectl context' subcommands
brew "kubectl" # cli for kubernetes API
brew "helm" # cli for provisioning kubernetes resources
brew "less" # a better pager
brew "lolcat" # prettier 'cat' command
brew "lua-language-server" # LSP for Lua
brew "masscan" # more aggressive network scanner (for hacking)
brew "mediainfo" # get metadata from video & audio files
brew "mercurial" # svn version control
brew "mosh" # a more resliant ssh server over UDP
brew "mitmproxy" # (for hacking)
brew "mkcert" # make local, trustable TLS certs
brew "mutt" # SNMP mail client
brew "neofetch" # display system info
brew "neovim" # THE text editor
brew "netcat" # network utility
brew "nethogs" # network usage inspector
brew "ninja" # a faster build system (like clang?)
brew "nload" # load testing tool
brew "nmap" # network scanner
brew "node" # something for javascript
brew "nvm" # node version manager
brew "octant" # 'top' for kubernetes
brew "optipng" # PNG file optimization utility
brew "p7zip" # 7-Zip file archiver
brew "par" # a paragraph [of text] formatting tool
brew "parallel" # run a command on multiple cores
brew "pkg-config" # return metainfo about installed libraries
brew "pngcrush" # PNG compression utility
brew "procs" # a more human-friedly 'ps' command
brew "pstree" # list 'ps' processes as a tree
brew "psutils" # PostScript document handling utilities
brew "pyenv" # python environment utility
brew "pyenv-virtualenv" # python environment utility
brew "pylint" # must be installed for vim-ale
brew "python" # a slow computer programming language
brew "reattach-to-user-namespace"
brew "redis" # in-memory cache
brew "ripgrep" # a faster 'grep'
brew "rsync" # a better 'cp' command
brew "shellcheck" # shell script static analyzer
brew "siege" # a load testing tool
brew "sk" # skim: fuzzy finder in rust
brew "sox" # Sound eXchange: play, record and convert audio files.
brew "spotify-tui" # put spotify controls in tmux
brew "sqlite" # database
brew "subversion" # source control
brew "tcpdump" # inspect network traffic
brew "telnet" # ssh 1.0
brew "tldr" # a different man pages
brew "tmux" # terminal multiplexor for long-lived sessions
brew "tree" # file system explorer
brew "txn2/tap/kubefwd" # expose kubernetes (K8s) service for local development
brew "upx" # compress/expand executable files
brew "vim" # :)
brew "watch" # execute a program periodically
brew "wget" # download from internet
brew "xz" # compress/decompress files
brew "yarn" # idk which yarn this is: either javascript or distributed data compute tool
brew "youtube-dl" # media file downloader
brew "zoxide" # a better 'cd' command, and better than autojump
brew "zsh" # default MacOS shell
brew "zstd" # Zstandard compression
cask "amethyst" # a shitty automatic tiling window manager
cask "anki" # a notecard app
cask "karabiner-elements" # keyboard key configuration app
cask "rectangle" # a manual tiling window manager
cask "iterm2" # a better version of MacOS Terminal
#cask "spotify" # music app
#https://gist.github.com/davidteren/898f2dcccd42d9f8680ec69a3a5d350e
