tap "cue-lang/tap"
tap "homebrew/cask"
tap "jzelinskie/faq"
tap "txn2/tap"
brew "act" # github actions
brew "autojump" # a smarter cd
brew "awscli" # AWS cloud cli
brew "axel" # a faster curl
brew "azure-cli" # Azure cloud cli
brew "bash-completion" # back shell tab completions
brew "bat" # a more colorful 'cat' command
brew "binwalk" # https://github.com/ReFirmLabs/binwalk
brew "black" # python code formatter
brew "broot" # a better 'tree' command
brew "btop" # a more intuitive, prettier 'top' command
brew "cloc" # statistics utility to count lines of code
brew "cmake" # for building c code
brew "coreutils" # must be installed for tmux network status plugin
brew "cowsay" # a more stupid 'echo' command
brew "ctags"
brew "cue-lang/tap/cue"
brew "curl" # use HTTP protocol from command line
brew "diffstat"
brew "entr"
brew "exa" # a faster, prettier 'ls' command
brew "ffmpeg" # modify media files (image, video, audio) from command line
brew "fio" # io benchmark tool
brew "flake8" # python linter (must be installed for vim-ale)
brew "gawk" # must be installed for tmux network status plugin
brew "gh" # github command line extension
brew "git" # the most important
brew "git-crypt"
brew "git-delta" # for prettier `git diff`
brew "glances" # a prettier 'top' command (not as pretty as `htop` or `btop`)
brew "gnu-sed"
brew "go" # the language, go-lang
brew "golangci-lint"
brew "goreman"
brew "gping" # a prettier 'ping' command
brew "http-prompt"
brew "httpie" # a more intuitive 'curl'
brew "htop" # a prettier 'top'
brew "hugo"
brew "iftop" # 'top' for network interfaces
brew "imagemagick"
brew "jpegoptim"
brew "jzelinskie/faq/faq"
brew "kind" # something for kubernetes, idk
brew "kubectx" # a wrapper around 'kubectl context' subcommands
brew "kubectl" # cli for kubernetes API
brew "helm" # cli for provisioning kubernetes resources
brew "less" # a better pager
brew "lolcat" # prettier 'cat' command
brew "lua-language-server"
brew "masscan" # more aggressive network scanner (for hacking)
brew "mediainfo"
brew "mercurial" # svn version control
brew "mosh" # a more resliant ssh server over UDP
brew "mitmproxy" # (for hacking)
brew "mkcert"
brew "mutt" # SNMP mail client
brew "neofetch"
brew "neovim" # THE text editor
brew "netcat" # network utility
brew "nethogs" # network usage inspector
brew "ninja"
brew "nload" # load testing tool
brew "nmap" # network scanner
brew "node"
brew "nvm"
brew "octant" # 'top' for kubernetes
brew "optipng"
brew "p7zip"
brew "par"
brew "parallel"
brew "pkg-config"
brew "pngcrush"
brew "procs"
brew "pstree"
brew "psutils"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pylint" # must be installed for vim-ale
brew "python"
brew "reattach-to-user-namespace"
brew "redis"
brew "ripgrep"
brew "rsync" # a better 'cp' command
brew "shellcheck"
brew "siege" # a load testing tool
brew "sk" # skim: fuzzy finder in rust
brew "sox"
brew "spotify-tui"
brew "sqlite" # database
brew "subversion"
brew "tcpdump" # inspect network traffic
brew "telnet" # ssh 1.0
brew "tmux" # terminal multiplexor for long-lived sessions
brew "tree" # file system explorer
brew "txn2/tap/kubefwd"
brew "upx"
brew "vim"
brew "watch"
brew "wget"
brew "xz"
brew "yarn"
brew "youtube-dl"
brew "zoxide"
brew "zsh"
brew "zstd"
cask "amethyst"
cask "anki"
cask "karabiner-elements"
cask "rectangle"
cask "iterm2"
#cask "spotify"
#https://gist.github.com/davidteren/898f2dcccd42d9f8680ec69a3a5d350e
